PHP Framework - CRUD 2/app/Controllers/Film.php

            'duration' => $this->request->getPost('duration'),
            'cover' => $imageName,
        ];
        $this->film->save($data);
---
INSERT INTO `film` (`nama_film`, `id_genre`, `duration`, `cover`) VALUES ('Gatot Kaca', '1', ' 2 jam 20 menit', '1688395070_aa040d8e5832fd8e5ece.jpg')