PHP Framework - CRUD 2/app/Controllers/Genre.php

    public function edit()
    {
        $validation = $this->validate([
            'nama_genre' => [
                'rules' => 'required',
                'errors' => [
                    'required' => 'Kolom Nama Genre harus diisi'
                ]
            ]
        ]);

        if (!$validation) {
            $errors = \Config\Services::validation()->getErrors();

            return redirect()->back()->withInput()->with('errors', $errors);
        }


        // taambah request id
        $data = [
            'id_genre' => $this->request->getPost('id_genre'),
            'nama_genre' => $this->request->getPost('nama_genre'),
        ];


        $this->genre->save($data);
---
INSERT INTO `genre` (`nama_genre`) VALUES ('Comedy')