PHP Framework - CRUD 2/app/Models/FilmModel.php

    public function getAllDataJoin()
    {
        $query = $this->db->table("film")
            ->select("film.*, genre.nama_genre")
            ->join("genre", "genre.id_genre  = film.id_genre")
            ->orderBy("film.nama_film", "ASC");
        return $query->get()->getResultArray();
---
SELECT `film`.*, `genre`.`nama_genre`
FROM `film`
JOIN `genre` ON `genre`.`id_genre`  = `film`.`id_genre`
ORDER BY `film`.`nama_film` ASC