PHP Framework - CRUD 2/app/Models/GenreModel.php

SELECT *
FROM `genre`
WHERE `nama_genre` IS NULL
---
    public function getAllData()
    {
        return $this->orderBy('nama_genre', 'ASC')->findAll();