PHP Framework - CRUD 2/app/Models/GenreModel.php

    public function getAllData()
    {
        return $this->findAll();
---
SELECT *
FROM `genre`