PHP Framework - Keamanan URL/app/Models/FilmModel.php

    public function getAllDataJoin()
    {
        $query = $this->db->table("film")
            ->select("film.*, genre.nama_genre")
            ->join("genre", "genre.id_genre  = film.id_genre")
            ->orderBy("film.nama_film", "ASC");
        return $query->get()->getResultArray();
---
SELECT `film`.*, `genre`.`nama_genre`
FROM `film`
JOIN `genre` ON `genre`.`id_genre`  = `film`.`id_genre`
ORDER BY `film`.`nama_film` ASC

    public function getDataById($id)
    {
        return $this->find($id);
---
SELECT *
FROM `film`
WHERE `film`.`id` = '62'