PHP Framework - Keamanan URL/app/Models/GenreModel.php

    public function getAllData()
    {
        return $this->orderBy('nama_genre', 'ASC')->findAll();
---
SELECT *
FROM `genre`
ORDER BY `nama_genre` ASC