PHP Framework - Keamanan URL/app/Controllers/Film.php

            'duration' => $this->request->getPost('duration'),
            'cover' => $imageName,
        ];
        $this->film->save($data);
---
INSERT INTO `film` (`nama_film`, `id_genre`, `duration`, `cover`) VALUES ('Gatot Kaca', '1', ' 2 jam 24 menit', '1687963158_2cd5c4c91403a255ee6e.jpg')