PHP Framework - Membuat Tampilan Menarik Menggunakan Bootstrap/app/Models/GenreModel.php

SELECT *
FROM `genre`
---
    public function getAllData()
    {
        return $this->findAll();